Revit 2027 API
RuledFace.RulingsAreParallel Property
Determines if the rulings of this ruled surface are parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RulingsAreParallel { get; }
Public ReadOnly Property RulingsAreParallel As Boolean
	Get
public:
property bool RulingsAreParallel {
	bool get ();
}
member RulingsAreParallel : bool with get
Property Value
Boolean
See Also
Reference
RuledFace Class
Autodesk.Revit.DB Namespace